from spacy.symbols import ORTH, NORM


_exc = {}

# Units of measure 
METRICS_NO_DOT_EXC = [
    {ORTH: "м", NORM: "метър"},
      { ORTH: "мг", NORM: "милиграма" },
  { ORTH: "мл", NORM: "милилитри" },
    {ORTH: "мм", NORM: "милиметър"},
    {ORTH: "см", NORM: "сантиметър"},
    {ORTH: "дм", NORM: "дециметър"},
    {ORTH: "кг", NORM: "килограм"}, 
    {ORTH: "мг", NORM: "милиграм"},
    {ORTH: "г", NORM: "грам"},
    {ORTH: "т", NORM: "тон"},
    {ORTH: "хл", NORM: "хектолиър"},
    {ORTH: "дкл", NORM: "декалитър"},
    {ORTH: "л", NORM: "литър"},
    { ORTH: "кв.м", NORM: "квадратен метър" },
    { ORTH: "кв. м", NORM: "квадратен метър" },
    { ORTH: "куб.м", NORM: "кубичен метър" },
    { ORTH: "куб. м", NORM: "кубичен метър" },
    { ORTH: "кв.см", NORM: "квадратен сантиметър" },
   { ORTH: "кв. см", NORM: "квадратен сантиметър" },
      { ORTH: "кв.мм", NORM: "квадратен милиметър" },
  { ORTH: "кв. мм", NORM: "квадратен милиметър" },
      { ORTH: "кв.дм", NORM: "квадратен дециметър" },
  { ORTH: "кв. дм", NORM: "квадратен дециметър" },
  { ORTH: "куб.см", NORM: "кубичен сантиметър" },
  { ORTH: "куб. см", NORM: "кубичен сантиметър" },
  { ORTH: "куб.дм", NORM: "кубичен дециметър" },
  { ORTH: "куб. дм", NORM: "кубичен дециметър" },
]

for abbr in METRICS_NO_DOT_EXC:
    _exc[abbr[ORTH]] = [abbr]

# Hyphenated abbreviations     
DASH_ABBR_EXC = [
    {ORTH: "г-жа", NORM: "госпожа"},
    {ORTH: "г-жо", NORM: "госпожо"}, 
    {ORTH: "г-н", NORM: "господин"},
    {ORTH: "г-не", NORM: "господине"}, 
    {ORTH: "г-ца", NORM: "госпожица"},
    {ORTH: "г-це", NORM: "госпожице"}, 
    {ORTH: "д-р", NORM: "доктор"},
    {ORTH: "о-в", NORM: "остров"},
    {ORTH: "п-в", NORM: "полуостров"},
]

# Titlecased hyphenated abbreviations
DASH_ABBR_TITLE_EXC =[] 
for item in DASH_ABBR_EXC: 
    DASH_ABBR_TITLE_EXC.append({ORTH: item[ORTH].title(), NORM: item[NORM].title()})

# Adding     
for abbr in DASH_ABBR_EXC:
    _exc[abbr[ORTH]] = [abbr]
    
for abbr in DASH_ABBR_TITLE_EXC:
    _exc[abbr[ORTH]] = [abbr]    

# Abbreviations with a period that cannot be at the end of a sentence
ABBR_DOT_MIDDLE_EXC = [
    # Titles 
    {ORTH: "акад.", NORM: "академик"}, 
    {ORTH: "проф.", NORM: "професор"},
    {ORTH: "ас.", NORM: "асистент"}, 
    { ORTH: "с.ас.", NORM: "старши асистент" },
    {ORTH: "преп.", NORM: "преподавател"},
    {ORTH: "д.т.н.", NORM: "доктор на техническите науки" },
    {ORTH: "д.ик.н.", NORM: "доктор на икономическите науки"},
    {ORTH: "арх.", NORM: "архитект"},
    {ORTH: "инж.", NORM: "инженер"},
    {ORTH: "доц.", NORM: "доцент"}, 
    {ORTH: "св.", NORM: "свети"},
    
    # Locations 
    {ORTH: "бл.", NORM: "блок"},
    {ORTH: "бул.", NORM: "булевард"},
    {ORTH: "гр.", NORM: "град"},
    {ORTH: "яз.", NORM: "язовир"}, 
    {ORTH: "р.", NORM: "река"}, 
    {ORTH: "ж.к.", NORM: "жилищен квартал"}, 
    {ORTH: "ап.", NORM: "апартамент"}, 
    {ORTH: "н.", NORM: "номер"}, 
    {ORTH: "пл.", NORM: "площад"},
    {ORTH: "с.", NORM: "село"},
    {ORTH: "ул.", NORM: "улица"},
    {ORTH: "чл.", NORM: "член"}, 
    {ORTH: "кв.", NORM: "квартал" },
    {ORTH: "п.к.", NORM: "пощенска кутия"},
    
    # Other 
    { ORTH: "абз.", NORM: "абзац" },
    {ORTH: "ал.", NORM: "алинея"},
    {ORTH: "сп.", NORM: "списание"},
    {ORTH: "стр.", NORM: "страница"},
    {ORTH: "бр.", NORM: "брой"},
    {ORTH: "мат.", NORM: "математика"},
    {ORTH: "мед.", NORM: "медицина"},
    { ORTH: "авг.", NORM: "август" },
    { ORTH: "австр.", NORM: "австрийски" },
    { ORTH: "австрал.", NORM: "австралийски" },
    { ORTH: "авт.", NORM: "автор" },
    { ORTH: "адм.", NORM: "административен" },
  { ORTH: "алб.", NORM: "албански" },
  { ORTH: "алж.", NORM: "алжирски" },
  { ORTH: "анат.", NORM: "анатомически" },
  { ORTH: "англ.", NORM: "английски" },
  { ORTH: "апр.", NORM: "април" },
  { ORTH: "арх.", NORM: "архитект" },
  { ORTH: "афр.", NORM: "африкански" },
  { ORTH: "бр.", NORM: "брой" },
{ ORTH: "бул.", NORM: "булевард" },
  { ORTH: "бълг.", NORM: "български" },
  { ORTH: "в.", NORM: "век" },
  { ORTH: "вр.", NORM: "връх" },
  { ORTH: "вж.", NORM: "виж" },
  { ORTH: "вр.", NORM: "връх" },
  { ORTH: "вкл.", NORM: "включително" },
  { ORTH: "вм.", NORM: "вместо" },
  { ORTH: "вс.", NORM: "всички" },
  { ORTH: "вт.", NORM: "вторник" },
  { ORTH: "втор.", NORM: "вторник" },
  { ORTH: "гл.", NORM: "главен" },
  { ORTH: "ед.", NORM: "единица" },
  { ORTH: "ет.", NORM: "етаж" },
  { ORTH: "жил.", NORM: "жилищен" },
  { ORTH: "заб.", NORM: "забележка" },
  { ORTH: "забел.", NORM: "забележка" },
  { ORTH: "зам.", NORM: "заместник" },
  { ORTH: "зап.", NORM: "западен" },
  { ORTH: "изд.", NORM: "издателство" },
  { ORTH: "изкл.", NORM: "изключение" },
  { ORTH: "изр.", NORM: "изречение" },
  { ORTH: "изт.", NORM: "източен" },
  { ORTH: "инж.", NORM: "инженер" },
  { ORTH: "исп.", NORM: "испански" },
  { ORTH: "ит.", NORM: "италиански" },
  { ORTH: "итал.", NORM: "италиански" },
  { ORTH: "кап.", NORM: "капитан" },
  { ORTH: "кл.", NORM: "клас" },
  { ORTH: "кор.", NORM: "кореспондент" },
  { ORTH: "л.к.", NORM: "лична карта" },
    
]

# Titlecased abbreviations with a period that cannot be at the end of a sentence
ABBR_DOT_MIDDLE_TITLE_EXC = [] 
for item in ABBR_DOT_MIDDLE_EXC: 
    ABBR_DOT_MIDDLE_TITLE_EXC.append({ORTH: item[ORTH].title(), NORM: item[NORM].title()})

# Abbreviations with a period that can be at the end of a sentence
ABBR_DOT_END_EXC = [
    # Units of measure 
    {ORTH: "в.", NORM: "век"}, 
    {ORTH: "г.", NORM: "година"},
    {ORTH: "хил.", NORM: "хиляди"}, 
    {ORTH: "млн.", NORM: "милиона"}, 
        {ORTH: "м.", NORM: "метър"},
      { ORTH: "мг.", NORM: "милиграма" },
  { ORTH: "мл.", NORM: "милилитри" },
    {ORTH: "мм.", NORM: "милиметър"},
    {ORTH: "см.", NORM: "сантиметра"}, 
    {ORTH: "кг.", NORM: "килограма"}, 
    { ORTH: "кв.м.", NORM: "квадратен метър" },
    { ORTH: "кв. м.", NORM: "квадратен метър" },
    { ORTH: "куб.м.", NORM: "кубичен метър" },
    { ORTH: "куб. м.", NORM: "кубичен метър" },
  { ORTH: "кв.см.", NORM: "квадратен сантиметър" },
  { ORTH: "кв. см.", NORM: "квадратен сантиметър" },
  { ORTH: "кв.мм.", NORM: "квадратен милиметър" },
  { ORTH: "кв. мм.", NORM: "квадратен милиметър" },
  { ORTH: "кв.дм.", NORM: "квадратен дециметър" },
  { ORTH: "кв. дм.", NORM: "квадратен дециметър" },
  { ORTH: "куб.см.", NORM: "кубичен сантиметър" },
  { ORTH: "куб. см.", NORM: "кубичен сантиметър" },
  { ORTH: "куб.дм.", NORM: "кубичен дециметър" },
  { ORTH: "куб. дм.", NORM: "кубичен дециметър" },
    # Grammar categories
    {ORTH: "ж.р.", NORM: "женски род"}, 
    {ORTH: "с.р.", NORM: "среден род"},
    {ORTH: "м.р.", NORM: "мъжки род"},
    {ORTH: "ед.ч.", NORM: "единствено число"},
    {ORTH: "гл.", NORM: "глагол"},  
    { ORTH: "ез.", NORM: "език" },
      { ORTH: "т.ч.", NORM: "това число" },
  { ORTH: "т. ч.", NORM: "това число" },
  { ORTH: "ед.ч.", NORM: "единствено число" },
  { ORTH: "ед. ч.", NORM: "единствено число" },
  { ORTH: "л.к.", NORM: "лична карта" },
  { ORTH: "л. к.", NORM: "лична карта" },
  { ORTH: "м.г.", NORM: "миналата година" },
  { ORTH: "м. г.", NORM: "миналата година" },
  { ORTH: "мин.неопр.", NORM: "минало неопределено време" },
  { ORTH: "мин. неопр.", NORM: "минало неопределено време" },
  { ORTH: "мин.несв.", NORM: "минало несвършено време " },
  { ORTH: "мин. несв.", NORM: "минало несвършено време " },
  { ORTH: "мин.св.", NORM: "минало свършено време" },
  { ORTH: "мин. св.", NORM: "минало свършено време" },
  { ORTH: "мн.ч.", NORM: "множествено число" },
  { ORTH: "мн. ч.", NORM: "множествено число" },
{ ORTH: "неопр.мест.", NORM: "неопределително местоимение" },
  { ORTH: "неопр. мест.", NORM: "неопределително местоимение" },
    # Others 
    {ORTH: "лв.", NORM: "лев"},
    { ORTH: "др.", NORM: "други" }, 
  { ORTH: "н.е.", NORM: "нова ера" },
  { ORTH: "н. е.", NORM: "нова ера" }, 
  { ORTH: "п.н.е.", NORM: "преди новата ера" },
  { ORTH: "п. н. е.", NORM: "преди новата ера" },
  { ORTH: "пр.н.е.", NORM: "преди новата ера" },
  { ORTH: "пр. н. е.", NORM: "преди новата ера" },
  { ORTH: "с.г.", NORM: "същата година" },
  { ORTH: "с. г.", NORM: "същата година" },
  { ORTH: "сл.н.е.", NORM: "след новата ера" },
  { ORTH: "сл. н. е.", NORM: "след новата ера" },
]

# Titlecased abbreviations with a period that cannot be at the end of a sentence
ABBR_DOT_TITLE_EXC = [] 
for item in ABBR_DOT_END_EXC:
    ABBR_DOT_TITLE_EXC.append({ORTH: item[ORTH].title(), NORM: item[NORM].title()})

for abbr in ABBR_DOT_MIDDLE_EXC:
    _exc[abbr[ORTH]] = [abbr]

for abbr in ABBR_DOT_MIDDLE_TITLE_EXC:
    _exc[abbr[ORTH]] = [abbr]
    
for abbr in ABBR_DOT_END_EXC:
    _exc[abbr[ORTH]] = [abbr]

 # Capitalized abbreviations  
ABBR_UPPERCASE_EXC = [
  { ORTH: "АА", NORM: "Административен акт" },
  { ORTH: "АГ", NORM: "Акушеро-гинекологичен" },
  { ORTH: "АД", NORM: "Акционерно дружество" },
  { ORTH: "АД-то", NORM: "Акционерното дружество" },
  { ORTH: "АД-та", NORM: "Акционерни дружества" },
  { ORTH: "АЕЦ", NORM: "Атомна електроцентрала" },
  { ORTH: "АЕЦ-ът", NORM: "Атомната електроцентрала" },
  { ORTH: "АКП", NORM: "африкански, карибски и тихоокеански държави" },
  { ORTH: "АОК", NORM: "Армия за освобождение на Косово" },
  { ORTH: "АП", NORM: "Агенция за приватизация" },
  { ORTH: "АПК", NORM: "Аграрно-промишлен комплекс" },
  { ORTH: "АПК-то", NORM: "Аграрно-промишленият комплекс" },
  { ORTH: "АПК-та", NORM: "Аграрно-промишлени комплекси" },
  { ORTH: "АС", NORM: "Административен съд" },
  { ORTH: "АСЕАН", NORM: "Асоциация на държавите от Юго-Източна Азия" },
  { ORTH: "АСП", NORM: "Алтернативна социалистическа партия" },
  {
    ORTH: "АСЦИЕ",
    NORM: "Асоциирани страни от Централна и Източна Европа"
  },
  { ORTH: "АТБ", NORM: "Асоциация на търговските банки" },
  { ORTH: "АТЦ", NORM: "Автоматична телефонна централа" },
  { ORTH: "АУБ", NORM: "Американски университет в България" },
  { ORTH: "АЧИ", NORM: "Агенция за чуждестранни инвестиции" },
  { ORTH: "АЧП", NORM: "Агенция за чуждестранна помощ" },
  { ORTH: "БАИФ", NORM: "Българо-американски инвестиционен фонд" },
  { ORTH: "БАН", NORM: "Българска академия на науките" },
  { ORTH: "БББ", NORM: "Български бизнесблок" },
  { ORTH: "ББИ", NORM: "Български библиографски институт" },
  { ORTH: "БВ", NORM: "Бърз влак" },
  { ORTH: "БВГ", NORM: "Българска вестникарска група" },
  { ORTH: "БВП", NORM: "Брутен вътрешен продукт" },
  { ORTH: "БДЖ", NORM: "Български държавни железници" },
  { ORTH: "БДЖ-то", NORM: "Българските държавни железници" },
  { ORTH: "БДС", NORM: "Български държавен стандарт" },
  { ORTH: "БЗК", NORM: "Банка за земеделски кредит" },
  { ORTH: "БЗНС", NORM: "Български земеделски народен съюз" },
  { ORTH: "БЗНС-то", NORM: "Българският земеделски народен съюз" },
  { ORTH: "БЗНС-та", NORM: "Български земеделски народни съюзи" },
  {
    ORTH: "БЗНС-НС",
    NORM: "Български земеделски народен съюз-Народен съюз"
  },
  { ORTH: "БЗПБ", NORM: "Българска земеделска и промишлена банка" },
  { ORTH: "БИБ", NORM: "Българска инвестиционна банка" },
  { ORTH: "БКК", NORM: "Банкова консолидационна комисия" },
  { ORTH: "БКП", NORM: "Българска комунистическа партия" },
  { ORTH: "БКП-то", NORM: "Българска комунистическа партия" },
  { ORTH: "БЛС", NORM: "Български лекарски съюз" },
  { ORTH: "БМВ", NORM: "Кола от Баварския автомобилен завод" },
  { ORTH: "БМВ-то", NORM: "колата от Баварския автомобилен завод" },
  { ORTH: "БМВ-та", NORM: "коли от Баварския автомобилен завод" },
  { ORTH: "БМВ-тата", NORM: "колите от Баварския автомобилен завод" },
  { ORTH: "БМК", NORM: "Българска музикална компания" },
  { ORTH: "БМФ", NORM: "Български морски флот" },
  { ORTH: "БНБ", NORM: "Българска народна банка" },
  {
    ORTH: "БНДРП",
    NORM: "Българска националдемократическа работническа партия"
  },
  { ORTH: "БНП", NORM: "Брутен национален продукт" },
  { ORTH: "БНР", NORM: "Българско национално радио" },
  { ORTH: "БНТ", NORM: "Българска национална телевизия" },
  { ORTH: "БОДК", NORM: "Бюро за обслужване на дипломатическия корпус" },
  { ORTH: "БОК", NORM: "Български олимпийски комитет" },
  { ORTH: "БПБ", NORM: "Българска пощенска банка" },
  { ORTH: "БР", NORM: "Българско радио" },
  { ORTH: "БРИБ", NORM: "Българо-руска инвестиционна банка" },
  { ORTH: "БРП", NORM: "Българска работническа партия" },
  { ORTH: "БСДП", NORM: "Българска социалдемократическа партия" },
  { ORTH: "БСК", NORM: "Българска стопанска камара" },
  { ORTH: "БСП", NORM: "Българска социалистическа партия" },
  { ORTH: "БСС", NORM: "Български стоматологичен съюз" },
  { ORTH: "БСФС", NORM: "Български съюз за физкултура и спорт" },
  { ORTH: "БСУ", NORM: "Бургаски свободен университет" },
  { ORTH: "БТ", NORM: "Българска телевизия" },
  { ORTH: "БТ", NORM: "Булгартабак" },
  { ORTH: "БТА", NORM: "Българска телеграфна агенция" },
  { ORTH: "БТК", NORM: "Българска телекомуникационна компания" },
  { ORTH: "БТПП", NORM: "Българска търговско-промишлена палата" },
  { ORTH: "БТР", NORM: "Бронетранспортьор за разузнаване" },
  { ORTH: "БУБ", NORM: "Балканска универсална банка" },
  {
    ORTH: "Булстат",
    NORM: "Единен държавен регистър на стопанските субекти"
  },
  { ORTH: "БУС", NORM: "Български учителски съюз" },
  { ORTH: "БФБ", NORM: "Българска фондова борса" },
  { ORTH: "БФВ", NORM: "Българска федерация по волейбол" },
  { ORTH: "БФВТ", NORM: "Българска федерация по вдигане на тежести" },
  { ORTH: "БФМ", NORM: "Българска федерация по мотоциклетизъм" },
  { ORTH: "БФЛА", NORM: "Българска федерация по лека атлетика" },
  { ORTH: "БФС", NORM: "Български футболен съюз" },
  { ORTH: "БФХГ", NORM: "Българска федерация по художествена гимнастика" },
  { ORTH: "БХК", NORM: "Български хелзинкски комитет" },
  {
    ORTH: "БЦЖ",
    NORM: "Бацили на Калмет-Герен-противотуберколозна ваксина"
  },
  { ORTH: "БЧК", NORM: "Български червен кръст" },
  { ORTH: "Бенелюкс", NORM: "Белгия, Холандия и Люксембург" },
  {
    ORTH: "ВАЗ",
    NORM: "(кола от) Волгоградските автомобилостроителни заводи"
  },
  { ORTH: "ВАК", NORM: "Висша атестационна комисия" },
  { ORTH: "ВАС", NORM: "Върховен административен съд" },
  {
    ORTH: "ВАЦ",
    NORM: "Вестдойче алгемайне цайтунг - немска медийна групировка"
  },
  {
    ORTH: "ВАЦ-ов",
    NORM: "Вестдойче алгемайне цайтунг - немска медийна групировка"
  },
  {
    ORTH: "ВАЦ-овото",
    NORM: "Вестдойче алгемайне цайтунг - немска медийна групировка"
  },
  {
    ORTH: "ВАЦ-овите",
    NORM: "Вестдойче алгемайне цайтунг - немска медийна групировка"
  },
  {
    ORTH: "ВАЦ-овият",
    NORM: "Вестдойче алгемайне цайтунг - немска медийна групировка"
  },
  { ORTH: "ВВВУ", NORM: "Висше военно-въздушно училище" },
  { ORTH: "ВВМУ", NORM: "Висше военно-морско училище" },
  { ORTH: "ВВС", NORM: "Военно-въздушни сили" },
  { ORTH: "ВВУ", NORM: "Военно-въздушно училище" },
  { ORTH: "ВЕЦ", NORM: "Водно-електрическа централа" },
  { ORTH: "ВЕЦ-ът", NORM: "Водно-електрическата централа" },
  { ORTH: "ВЕЦ-ове", NORM: "Водно-електрически централи" },
  { ORTH: "ВЕЦ-овете", NORM: "Водно-електрическите централи" },
  { ORTH: "ВИАС", NORM: "Висш институт за архитектура и строителство" },
  { ORTH: "ВиК", NORM: "Водоснабдяване и канализация" },
  { ORTH: "ВИП", NORM: "Много важна личност" },
  { ORTH: "ВИП", NORM: "Място за посрещане" },
  { ORTH: "ВИП-a", NORM: "Много важната личност" },
  { ORTH: "ВИП-a", NORM: "Мястото за посрещане" },
  { ORTH: "ВИС", NORM: "Vasil Iliev Security" },
  { ORTH: "ВИТИЗ", NORM: "Висш институт за театрално изкуство" },
  { ORTH: "ВКДП", NORM: "Виенска конвенция за договорно право" },
  { ORTH: "ВКР", NORM: "Военно контраразузнаване" },
  { ORTH: "ВКС", NORM: "Върховен касационен съд" },
  { ORTH: "ВМА", NORM: "Военно-медицинска академия" },
  { ORTH: "ВМЕИ", NORM: "Висш машинно-електротехнически институт" },
  { ORTH: "ВМЗ", NORM: "Вазовски машиностроителни заводи" },
  { ORTH: "ВМИ", NORM: "Висш медицински институт" },
  { ORTH: "ВМРО", NORM: "Вътрешна македонска революционна организация" },
  { ORTH: "ВМС", NORM: "Военно-морски сили" },
  { ORTH: "ВМФ", NORM: "Военноморски флот" },
  { ORTH: "ВНС", NORM: "Велико народно събрание" },
  { ORTH: "ВП", NORM: "Вътрешен пазар" },
  { ORTH: "ВПК", NORM: "Военно-промишлен комплекс" },
  { ORTH: "ВПС", NORM: "Висш партиен съвет" },
  { ORTH: "ВР", NORM: "Военно разузнаване" },
  { ORTH: "ВС", NORM: "Върховен съд" },
  { ORTH: "ВСС", NORM: "Висш съдебен съвет" },
  { ORTH: "ВТО", NORM: "Външнотърговско обединение" },
  { ORTH: "ВТУ", NORM: "Великотърновски университет" },
  { ORTH: "ВУЗ", NORM: "Висше учебно заведение" },
  { ORTH: "ВУЗ-ът", NORM: "Висшето учебно заведение" },
  { ORTH: "ВУЗ-овете", NORM: "Висшите учебни заведения" },
  { ORTH: "ГАТТ", NORM: "Общо споразумение за тарифите и търговията" },
  { ORTH: "ГАТТ", NORM: "Общо споразумение за митата и търговията" },
  { ORTH: "ГГЗ", NORM: "Германски граждански законник" },
  { ORTH: "ГД", NORM: "Главна дирекция" },
  { ORTH: "ГДД", NORM: "Главна данъчна дирекция" },
  { ORTH: "ГДР", NORM: "Германска демократична република" },
  { ORTH: "ГЕСП", NORM: "Германска единна социалистическа партия" },
  { ORTH: "ГК", NORM: "Граждански кодекс" },
  { ORTH: "ГКПП", NORM: "Граничен контролно-пропускателен пункт" },
  { ORTH: "ГКПП-та", NORM: "Гранични контролно-пропускателни пунктове" },
  {
    ORTH: "ГКПП-тата",
    NORM: "Граничните контролно-пропускателни пунктове"
  },
  {
    ORTH: "ГОДО",
    NORM: "Гражданско обединение на демократичните организации"
  },
  { ORTH: "ГПК", NORM: "Гражданско-процесуален кодекс" },
  { ORTH: "ГСДП", NORM: "Германска социал-демократическа партия" },
  { ORTH: "ГУ", NORM: "Главно управление" },
  { ORTH: "ГУДА", NORM: "Главно управление на данъчната администрация" },
  { ORTH: "ГУМ", NORM: "Градски универсален магазин" },
  { ORTH: "ГУП", NORM: "Главно управление на пътищата" },
  { ORTH: "ГУСВ", NORM: "Главно управление на строителни войски" },
  { ORTH: "ГЩ", NORM: "Генерален щаб" },
  { ORTH: "ГлЩ", NORM: "Главен щаб" },
  { ORTH: "ДАИ", NORM: "Държавна автомобилна инспекция" },
  { ORTH: "ДАМС", NORM: "Държавна агенция за младежта и спорта" },
  { ORTH: "ДАП", NORM: "Държавно автомобилно предприятие" },
  { ORTH: "ДВСК", NORM: "Държавен ветеринарно-санитарен контрол" },
  { ORTH: "ДДС", NORM: "Данък добавена стойност" },
  { ORTH: "ДДС-то", NORM: "Данъкът добавена стойност" },
  {
    ORTH: "ДЕИО",
    NORM: "Договор за създаване на Европейската икономическа общност"
  },
  { ORTH: "ДЕО", NORM: "Договор за създаване на Европейската общност" },
  {
    ORTH: "ДЕОАЕ",
    NORM: "Договор за създаване на Европейската общност за атомна енергия"
  },
  {
    ORTH: "ДЕОВС",
    NORM: "Договор за създаване на Европейската общност за въглища и стомана"
  },
  { ORTH: "ДЕС", NORM: "Договор за Европейския съюз" },
  { ORTH: "ДЗИ", NORM: "Държавен застрахователен институт" },
  { ORTH: "ДЗС", NORM: "Държавно земеделско стопанство" },
  { ORTH: "ДЗУ", NORM: "Дисково-запаметяващи устройства" },
  { ORTH: "ДКД", NORM: "Държавен комитет за далекосъобщения" },
  { ORTH: "ДКМС", NORM: "Димитровски комунистически младежки съюз" },
  { ORTH: "ДКЦК", NORM: "Държавна комисия по ценни книжа" },
  { ORTH: "ДЛ", NORM: "Демократична левица" },
  { ORTH: "ДМ", NORM: "Дойче марки" },
  { ORTH: "ДМА", NORM: "Дълготраен материален актив" },
  { ORTH: "ДНК", NORM: "Дезоксирибонуклеинова киселина" },
  { ORTH: "ДНП", NORM: "Дирекция Национална полиция" },
  { ORTH: "ДОД", NORM: "Данък общ доход" },
  { ORTH: "ДОО", NORM: "Държавно обществено осигуряване" },
  { ORTH: "ДП", NORM: "Държавно предприятие" },
  { ORTH: "ДП", NORM: "Демократическа партия" },
  { ORTH: "ДПО", NORM: "Допълнително пенсионно осигуряване" },
  { ORTH: "ДПС", NORM: "Движението за права и свободи" },
  { ORTH: "ДС", NORM: "Държавна сигурност" },
  { ORTH: "ДСК", NORM: "Държавна спестовна каса" },
  { ORTH: "ДСО", NORM: "Държавно стопанско обединение" },
  { ORTH: "ДФ", NORM: "Държавен фонд" },
  { ORTH: "ДФК", NORM: "Държавен финансов контрол" },
  { ORTH: "ДФРР", NORM: "Държавен фонд за реконструкция и развитие" },
  { ORTH: "ДЦК", NORM: "Държавни ценни книжа" },
  { ORTH: "ЕАД", NORM: "Еднолично акционерно дружество" },
  { ORTH: "ЕКИП", NORM: "Екип за изследвания и прогнози" },
  { ORTH: "ЕАСТ", NORM: "Европейска асоциация за свободна търговия" },
  { ORTH: "ЕБВР", NORM: "Европейска банка за възстановяване и развитие" },
  { ORTH: "ЕВ", NORM: "Експресен влак" },
  { ORTH: "ЕВИ", NORM: "Европейски валутен институт" },
  { ORTH: "ЕВРАТОМ", NORM: "Европейска общност за атомна енергия" },
  { ORTH: "ЕВС", NORM: "Европейска валутна система" },
  { ORTH: "ЕГН", NORM: "Единен граждански номер" },
  { ORTH: "ЕГН-то", NORM: "Единният граждански номер" },
  { ORTH: "ЕГН-тата", NORM: "Единните граждански номера" },
  { ORTH: "ЕЕА", NORM: "Единен европейски акт" },
  { ORTH: "ЕИБ", NORM: "Европейска инвестиционна банка" },
  { ORTH: "ЕИО", NORM: "Европейска икономическа общност" },
  { ORTH: "ЕИП", NORM: "Европейско икономическо пространство" },
  { ORTH: "ЕК", NORM: "Европейска комисия" },
  { ORTH: "ЕК", NORM: "Кабелна телевизия Евроком" },
  { ORTH: "ЕКПЧ", NORM: "Европейска конвенция за правата на човека" },
  { ORTH: "ЕКЮ", NORM: "Европейска валутна единица" },
  { ORTH: "ЕО", NORM: "Европейска общност" },
  { ORTH: "ЕОАЕ", NORM: "Европейска общност за атомна енергия" },
  { ORTH: "ЕОВС", NORM: "Европейска общност за въглища и стомана" },
  {
    ORTH: "ЕОИС",
    NORM: "Европейска организация за икономическо сътрудничество"
  },
  { ORTH: "ЕОО", NORM: "Европейска отбранителна общност" },
  { ORTH: "ЕООД", NORM: "Еднолично дружество с ограничена отговорност" },
  { ORTH: "ЕП", NORM: "Европейски парламент" },
  { ORTH: "ЕПО", NORM: "Европейска политическа общност" },
  { ORTH: "ЕПС", NORM: "Европейско политическо сътрудничество" },
  { ORTH: "ЕС", NORM: "Европейски съюз" },
  {
    ORTH: "ЕСГРАОН",
    NORM: "Единна система за гражданска регистрация и административно обслужване на населението"
  },
  { ORTH: "ЕСФ", NORM: "Европейски социален фонд" },
  { ORTH: "ЕТ", NORM: "Едноличен търговец" },
  { ORTH: "ЕСЦБ", NORM: "Европейска система на централните банки" },
  {
    ORTH: "ЕФОГСС",
    NORM: "Европейски фонд за ориентиране и гарантиране на селското стопанство"
  },
  { ORTH: "ЕЦБ", NORM: "Европейска централна банка" },
  { ORTH: "ЖЗК", NORM: "Животозастрахователна компания" },
  { ORTH: "ЖК", NORM: "Жилищен комплекс" },
  { ORTH: "ЖСК", NORM: "Жилищностроителна кооперация" },
  { ORTH: "ЗАД", NORM: "Застрахователно акционерно дружество" },
  { ORTH: "ЗАП", NORM: "Закон за административното производство" },
  { ORTH: "ЗДДС", NORM: "Закон за данък добавена стойност" },
  { ORTH: "ЗДОД", NORM: "Закон за данък върху общия доход" },
  { ORTH: "ЗЕС", NORM: "Западноевропейски съюз" },
  { ORTH: "ЗЗД", NORM: "Закон за задълженията и договорите" },
  { ORTH: "ЗЗК", NORM: "Закон за защита на конкуренцията" },
  { ORTH: "ЗЗО", NORM: "Закон за здравното осигуряване" },
  { ORTH: "ЗК", NORM: "Застрахователна компания" },
  { ORTH: "ЗК", NORM: "Здравна каса" },
  { ORTH: "ЗКПО", NORM: "Закон за корпоративното подоходно облагане" },
  { ORTH: "ЗММ", NORM: "Завод за металорежещи машини" },
  { ORTH: "ЗОДФЛ", NORM: "Закон за облагане доходите на физическите лица" },
  {
    ORTH: "ЗОСОИ",
    NORM: "Закон за обезщетяване на собствениците на одържавени имоти"
  },
  {
    ORTH: "ЗПАД",
    NORM: "Застрахователно и презастрахователно акционерно дружество"
  },
  { ORTH: "ЗПД", NORM: "Застрахователно и презастрахователно дружество" },
  { ORTH: "ЗПК", NORM: "Застрахователна и презастрахователна компания" },
  {
    ORTH: "ЗППДОП",
    NORM: "Закон за преобразуване и приватизация на държавни и общински предприятия"
  },
  {
    ORTH: "ЗСПЗЗ",
    NORM: "Закон за собствеността и ползване на земеделските земи"
  },
  { ORTH: "ЗСТ", NORM: "Зона за свободна търговия" },
  { ORTH: "ЗТСУ", NORM: "Закон за териториално и жилищно устройство" },
  { ORTH: "ЗУНК", NORM: "Закон за уреждане на необслужваните кредити" },
  { ORTH: "ЗУНК-а", NORM: "Закона за уреждане на необслужваните кредити" },
  {
    ORTH: "ЗУНК-ът",
    NORM: "Законът за уреждане на необслужваните кредити"
  },
  {
    ORTH: "ЗУНК-ове",
    NORM: "Закони за уреждане на необслужваните кредити"
  },
  { ORTH: "ЗУТ", NORM: "Закон за устройство на територията" },
  {
    ORTH: "ЗЦКФБИД",
    NORM: "Закон за ценните книжа, фондовите борси и инвестиционните дружества"
  },
  { ORTH: "ЗЧИ", NORM: "Закон за чуждестранните инвестиции" },
  {
    ORTH: "ИААФ",
    NORM: "Международна аматьорска лекоатлетическа федерация"
  },
  { ORTH: "ИБ", NORM: "Изпълнително бюро" },
  { ORTH: "ИВС", NORM: "Икономически и валутен съюз" },
  { ORTH: "ИК", NORM: "Изпълнителен комитет" },
  { ORTH: "ИК", NORM: "Издателска къща" },
  {
    ORTH: "ИКАО",
    NORM: "Международна организация за гражданската авиация"
  },
  { ORTH: "ИСК", NORM: "Икономически и социален комитет" },
  {
    ORTH: "ИСУЛ",
    NORM: "Институт за специализация и усъвършенстване на лекарите"
  },
  { ORTH: "ИТАР-ТАСС", NORM: "Информационно-телеграфна агенция" },
  { ORTH: "ИЧС", NORM: "Институт за чуждестранни студенти" },
  { ORTH: "КАТ", NORM: "Контрол на автомобилния транспорт" },
  { ORTH: "КГБ", NORM: "Комитет за държавна безопасност" },
  { ORTH: "КДА", NORM: "Командитно дружество с акции" },
  { ORTH: "КЗОО", NORM: "Кодекс за задължителното обществено осигуряване" },
  {
    ORTH: "КИАЕМЦ",
    NORM: "Комитет за използване на атомната енергия за мирни цели"
  },
  {
    ORTH: "КМФВС",
    NORM: "Комитет за младежко физическо възпитание и спорт"
  },
  { ORTH: "КНДР", NORM: "Китайска народна демократична република" },
  { ORTH: "КНК", NORM: "Купа на националните купи" },
  {
    ORTH: "КНСБ",
    NORM: "Конфедерация на независимите синдикати в България"
  },
  { ORTH: "КПД", NORM: "Коефициент на полезно действие" },
  { ORTH: "КПП", NORM: "Контролно-пропускателен пункт" },
  { ORTH: "КПП-то", NORM: "Контролно-пропускателния пункт" },
  { ORTH: "КПСС", NORM: "Комунистическа партия на Съветския съюз" },
  { ORTH: "КС", NORM: "Конституционен съд" },
  { ORTH: "КТ", NORM: "Кодекс на труда" },
  { ORTH: "КЦМ", NORM: "Комбинат за цветни метали" },
  { ORTH: "ЛАД", NORM: "Лига на арабските държави" },
  { ORTH: "ЛДП", NORM: "Либерал-демократическа партия" },
  { ORTH: "ЛДС", NORM: "Либерал-демократически съюз" },
  { ORTH: "ЛКК", NORM: "Лекарска консултативна комисия" },
  { ORTH: "МА", NORM: "Медицинска академия" },
  { ORTH: "МААЕ", NORM: "Международна агенция за атомна енергия" },
  { ORTH: "МБИР", NORM: "Международна банка за инвестиции и развитие" },
  { ORTH: "МБИС", NORM: "Международна банка за инвестиции и строителство" },
  { ORTH: "МБТР", NORM: "Международна банка за търговия и развитие" },
  { ORTH: "МВ", NORM: "Международен влак" },
  { ORTH: "МВР", NORM: "Министерство на вътрешните работи" },
  { ORTH: "МВФ", NORM: "Международен валутен фонд" },
  { ORTH: "МВнР", NORM: "Министерство на външните работи" },
  { ORTH: "МДК", NORM: "Медодобивен комбинат" },
  { ORTH: "МЕИ", NORM: "Машинно-електро-технически институт" },
  { ORTH: "МЗ", NORM: "Министерство на здравеопазването" },
  { ORTH: "МЗГ", NORM: "Министерство на земеделието и горите" },
  {
    ORTH: "МЗГАР",
    NORM: "Министерство на земеделието, горите и аграрната реформа"
  },
  {
    ORTH: "МЗХП",
    NORM: "Министерство на земеделието и хранителната промишленост"
  },
  { ORTH: "МИБ", NORM: "Международна инвестиционна банка" },
  { ORTH: "МИО", NORM: "Международни икономически отношения" },
  { ORTH: "МК", NORM: "Металургичен комбинат" },
  { ORTH: "МК", NORM: "Министерство на културата" },
  { ORTH: "МНО", NORM: "Министерство на народната отбрана" },
  { ORTH: "МНПО", NORM: "Международни неправителствени организации" },
  { ORTH: "МО", NORM: "Министерство на отбраната" },
  { ORTH: "МОК", NORM: "Международен олимпийски комитет" },
  {
    ORTH: "МОНТ",
    NORM: "Министерство на образованието, науката и техниката"
  },
  { ORTH: "МОСВ", NORM: "Министерство на околната среда и водите" },
  { ORTH: "МОТ", NORM: "Международна организация на труда" },
  { ORTH: "МП", NORM: "Международно право" },
  { ORTH: "МП", NORM: "Министерство на правосъдието" },
  { ORTH: "МПК", NORM: "Междуправителствена конференция" },
  { ORTH: "МПП", NORM: "Международно публично право" },
  { ORTH: "МРЗ", NORM: "Минимална работна заплата" },
  { ORTH: "МПС", NORM: "Моторно превозно средство" },
  { ORTH: "МС", NORM: "Министерски съвет" },
  { ORTH: "МТК", NORM: "Международна търговска камара" },
  { ORTH: "МСП", NORM: "Министерство на социалната политика" },
  { ORTH: "МТС", NORM: "Моторно-машинно-тракторна станция" },
  { ORTH: "МФ", NORM: "Министерство на финансите" },
  { ORTH: "НАТО", NORM: "Организация на северноатлантическия договор" },
  {
    ORTH: "НАТФИЗ",
    NORM: "Национална академия за театрално и филмово изкуство"
  },
  { ORTH: "НБА", NORM: "Национална баскетболна асоциация" },
  { ORTH: "НБКМ", NORM: "Национална библиотека Св. св. Кирил и Методий" },
  {
    ORTH: "НБТУБ",
    NORM: "Национално бюро за териториално убежище и бежанците към МС"
  },
  { ORTH: "НБУ", NORM: "Нов български университет" },
  { ORTH: "НВВУ", NORM: "Национално висше военно училище" },
  { ORTH: "НД", NORM: "Национално движение" },
  { ORTH: "НДСВ", NORM: "Национално движение Симеон Втори" },
  { ORTH: "НДК", NORM: "Национален дворец на културата" },
  { ORTH: "НДПС", NORM: "Национално движение за права и свободи" },
  { ORTH: "НЕК", NORM: "Национална електрическа компания" },
  { ORTH: "НЗК", NORM: "Национална здравна каса" },
  { ORTH: "НЗОК", NORM: "Национална здравно-осигурителна каса" },
  { ORTH: "НИС", NORM: "Национален изпълнителен съвет" },
  { ORTH: "НЛО", NORM: "Неидентифициран летящ обект" },
  { ORTH: "НИПК", NORM: "Национален институт за паметници на културата" },
  { ORTH: "НОИ", NORM: "Национален осигурителен институт" },
  { ORTH: "НОК", NORM: "Национален олимпийски комитет" },
  { ORTH: "НП", NORM: "Национална полиция" },
  { ORTH: "НП", NORM: "Наказателно право" },
  { ORTH: "НП", NORM: "Народна партия" },
  { ORTH: "НПК", NORM: "Наказателно-процесуален кодекс" },
  { ORTH: "НРБ", NORM: "Народна република България" },
  { ORTH: "НРС", NORM: "Национална разузнавателна служба" },
  { ORTH: "НС", NORM: "Народно събрание" },
  { ORTH: "НС", NORM: "Надзорен съвет" },
  { ORTH: "НСА", NORM: "Национална спортна академия" },
  {
    ORTH: "НСБОП",
    NORM: "Национална служба за борба с организираната престъпност"
  },
  { ORTH: "НСЗ", NORM: "Национална служба по заетостта" },
  { ORTH: "НСИ", NORM: "Национален статистически институт" },
  { ORTH: "НСНИ", NORM: "Национално сдружение за недвижими имоти" },
  { ORTH: "НСО", NORM: "Национална служба за охрана" },
  { ORTH: "НСРТ", NORM: "Национален съвет за радио и телевизия" },
  { ORTH: "НСС", NORM: "Национална следствена служба" },
  { ORTH: "НСС", NORM: "Национална съобщителна система" },
  { ORTH: "НСС", NORM: "Национален счетоводен стандарт" },
  { ORTH: "НСлС", NORM: "Национална следствена служба" },
  { ORTH: "НТ", NORM: "в. Нощен труд" },
  { ORTH: "НТВ", NORM: "Нова телевизия" },
  { ORTH: "НТС", NORM: "Научно-технически съюз" },
  { ORTH: "НФЛ", NORM: "Национална футболна лига" },
  { ORTH: "НФС", NORM: "Национална федерация по ски" },
  { ORTH: "НХГ", NORM: "Национална художествена галерия" },
  { ORTH: "НХЛ", NORM: "Национална хокейна лига" },
  {
    ORTH: "НЦИОМ",
    NORM: "Национален център за изучаване на общественото мнение"
  },
  { ORTH: "ОАД", NORM: "Организация на американските държави" },
  { ORTH: "ОАЕ", NORM: "Обединени арабски емирства" },
  { ORTH: "ОАЕ", NORM: "Организация за африканско единство" },
  { ORTH: "ОББ", NORM: "Обединена българска банка" },
  { ORTH: "ОБК", NORM: "Обединена българска компания" },
  { ORTH: "ОбС", NORM: "Общински съвет" },
  { ORTH: "ОБТ", NORM: "Обединен блок на труда" },
  { ORTH: "ОДС", NORM: "Обединени демократични сили" },
  {
    ORTH: "ОЕИС",
    NORM: "Организация за европейско икономическо сътрудничество"
  },
  {
    ORTH: "ОИСР",
    NORM: "Организация за икономическо сътрудничество и развитие"
  },
  {
    ORTH: "ОК",
    NORM: "Обединено кралство Великобритания и Северна Ирландия"
  },
  { ORTH: "ОЛП", NORM: "Основен лихвен процент" },
  { ORTH: "ОМТ", NORM: "Обща митническа тарифа" },
  { ORTH: "ОНД", NORM: "Общност на независимите държави" },
  { ORTH: "ОНС", NORM: "Обединение за национално спасение" },
  { ORTH: "ООД", NORM: "Дружество с ограничена отговорност" },
  { ORTH: "ООД-то", NORM: "Дружеството с ограничена отговорност" },
  { ORTH: "ООН", NORM: "Организация на обединените нации" },
  { ORTH: "ООП", NORM: "Обща организация на пазара" },
  { ORTH: "ООП", NORM: "Организация за освобождение на Палестина" },
  { ORTH: "ОП", NORM: "Общ пазар" },
  {
    ORTH: "ОПВС",
    NORM: "Обща политика в областта на външните отношения и сигурността"
  },
  { ORTH: "ОПЕК", NORM: "Организация на държавите-износителки на петрол" },
  {
    ORTH: "ОПОВОС",
    NORM: "Обща политика в областта на външните отношения и сигурността"
  },
  { ORTH: "ОСП", NORM: "Обща селскостопанска политика" },
  { ORTH: "ОСП", NORM: "Основи на социалистическото производство" },
  {
    ORTH: "ОССЕ",
    NORM: "Организация за сигурност и сътрудничество в Европа"
  },
  { ORTH: "ОТК", NORM: "Отдел Технически контрол" },
  { ORTH: "ОТП", NORM: "Обща търговска политика" },
  { ORTH: "ОТрП", NORM: "Обща транспортна политика" },
  { ORTH: "ОФ", NORM: "Отечествен фронт" },
  { ORTH: "ОХДЦ", NORM: "Обединен Християн-демократичен център" },
  { ORTH: "ОЦК", NORM: "Оловно-цинков комбинат" },
  {
    ORTH: "ПАВЕЦ",
    NORM: "Помпено-акумулаторна водноелектрическа централа"
  },
  { ORTH: "ПАСЕ", NORM: "Парламентарна асамблея на съвета на Европа" },
  { ORTH: "ПВ", NORM: "Пътнически влак" },
  { ORTH: "ПВО", NORM: "Противовъздушна отбрана" },
  { ORTH: "ПГ", NORM: "Парламентарна група" },
  { ORTH: "ПГДЛ", NORM: "Парламентарна група на демократичната левица" },
  { ORTH: "ПИБ", NORM: "Първа инвестиционна банка" },
  { ORTH: "ПИМБ", NORM: "Първа източна международна банка" },
  { ORTH: "ПИН", NORM: "личен идентификационен номер" },
  { ORTH: "ПКБ", NORM: "Фонд Професионална квалификация и безработица" },
  { ORTH: "ПМС", NORM: "Постановление на Министерския съвет" },
  { ORTH: "ППО", NORM: "Противопожарна охрана" },
  { ORTH: "ПРООН", NORM: "Програма за развитие на ООН" },
  { ORTH: "ПТС", NORM: "Подвижна телевизионна станция" },
  { ORTH: "ПУ", NORM: "Пловдивски университет" },
  { ORTH: "ПФБК", NORM: "Първа финансово-брокерска къща" },
  { ORTH: "ПФК", NORM: "Професионален футболен клуб" },
  { ORTH: "ПФЛ", NORM: "Професионална футболна лига" },
  { ORTH: "ПЧБ", NORM: "Първа частна банка" },
  { ORTH: "РВД", NORM: "Ръководство въздушно движение" },
  { ORTH: "РД", NORM: "Римски договор" },
  { ORTH: "РДВР", NORM: "Регионална дирекция на вътрешните работи" },
  { ORTH: "РДВР-тата", NORM: "Регионална дирекция на вътрешните работи" },
  { ORTH: "РЗОК", NORM: "Районна здравно-осигурителна каса" },
  { ORTH: "РИОСВ", NORM: "Районна инспекция по околната среда и водите" },
  { ORTH: "РМД", NORM: "Работническо-мениджърско дружество" },
  { ORTH: "РМД-то", NORM: "Работническо-мениджърско дружество" },
  { ORTH: "РМД-та", NORM: "Работническо-мениджърско дружество" },
  { ORTH: "РМД-тата", NORM: "Работническо-мениджърско дружество" },
  { ORTH: "РПУ", NORM: "Районно полицейско управление" },
  { ORTH: "РТР", NORM: "Радиотехническо разузнаване" },
  { ORTH: "РС", NORM: "Районен съд" },
  { ORTH: "РТС", NORM: "Районна телевизионна станция" },
  {
    ORTH: "РУМНО",
    NORM: "Разузнавателно управление на Министерството на народната отбрана"
  },
  { ORTH: "САБ", NORM: "Съюз на автомобилистите" },
  {
    ORTH: "САПАРД",
    NORM: "Специална присъединителна програма за селскостопанско и земеделско развитие"
  },
  { ORTH: "САЩ", NORM: "Съединените американски щати" },
  { ORTH: "СБЖ", NORM: "Съюз на българските журналисти" },
  { ORTH: "СБП", NORM: "Съюз на българските писатели" },
  { ORTH: "СБУ", NORM: "Съюз на българските учители" },
  { ORTH: "СБХ", NORM: "Съюз на българските художници" },
  { ORTH: "СГС", NORM: "Софийски градски съд" },
  { ORTH: "СГС", NORM: "Столична голяма община" },
  { ORTH: "СДВР", NORM: "Столична дирекция на вътрешните работи" },
  { ORTH: "СДП", NORM: "Социал-демократическа партия" },
  { ORTH: "СДС", NORM: "Съюз на демократичните сили" },
  { ORTH: "СДС-то", NORM: "Съюз на демократичните сили" },
  { ORTH: "СЕ", NORM: "Съвет на Европа" },
  { ORTH: "СЕО", NORM: "Съд на европейските общности" },
  { ORTH: "СЗО", NORM: "Световна здравна организация" },
  {
    ORTH: "СИДДО",
    NORM: "Спогодба за избягване на двойното данъчно облагане"
  },
  { ORTH: "СИК", NORM: "Секционна избирателна комисия" },
  { ORTH: "СИК", NORM: "Застрахователна компания" },
  { ORTH: "СКГТ", NORM: "Столична компания Градски транспорт" },
  { ORTH: "СНС", NORM: "Софийски народен съвет" },
  { ORTH: "СОАП", NORM: "Столична общинска агенция за приватизация" },
  {
    ORTH: "СОМАТ",
    NORM: "Стопанско обединение за международен автомобилен транспорт"
  },
  {
    ORTH: "СОПВР",
    NORM: "Сътрудничество в областта на правосъдието и вътрешните работи"
  },
  { ORTH: "СОТ", NORM: "Сигналноохранителна техника" },
  { ORTH: "СОТ", NORM: "Световна организация по търговия" },
  {
    ORTH: "СОТИ",
    NORM: "Служба за оперативно-техническа информация при МВР"
  },
  { ORTH: "СОУ", NORM: "Средно общообразователно училище" },
  { ORTH: "СПЕО", NORM: "Сметна палата на Европейските общности" },
  { ORTH: "СПИН", NORM: "Синдром на придобитата имунна недостатъчност" },
  { ORTH: "СПТУ", NORM: "Средно професионално-техническо училище" },
  { ORTH: "ПТУ-тата", NORM: "Професионално-техническо училище" },
  { ORTH: "СРЗ", NORM: "Средна работна заплата" },
  { ORTH: "СРС", NORM: "Софийски районен съд" },
  { ORTH: "СРЮ", NORM: "Социалистическа Република Югославия" },
  { ORTH: "ССБ", NORM: "Софийска стокова борса" },
  { ORTH: "ССБ", NORM: "Съюз на слепите в България" },
  { ORTH: "ССИГ", NORM: "Съюз за стопанска инициатива на гражданите" },
  { ORTH: "ССлС", NORM: "Специализирана следствена служба" },
  { ORTH: "СССР", NORM: "Съюз на съветските социалистически републики" },
  { ORTH: "СТО", NORM: "Световна търговска организация" },
  { ORTH: "СУ", NORM: "Софийски университет" },
  { ORTH: "СУАПО", NORM: "Народната организация на Юго-Западна Африка" },
  { ORTH: "СФБ", NORM: "Софийска фондова борса" },
  { ORTH: "СФРЮ", NORM: "Социалистическа федеративна република Югославия" },
  { ORTH: "СЦИЕ", NORM: "Страни от Централна и Източна Европа" },
  { ORTH: "ТБ", NORM: "Търговска банка" },
  { ORTH: "ТВ", NORM: "телевизия" },
  { ORTH: "ТВ", NORM: "телевизионен" },
  { ORTH: "ТВУ", NORM: "Трудово-възпитателно училище" },
  { ORTH: "ТЕЛК", NORM: "Трудово-експертна лекарска комисия" },
  { ORTH: "ТЕЦ", NORM: "Топло-електрическа централа" },
  { ORTH: "ТЕЦ-а", NORM: "Топло-електрическата централа" },
  { ORTH: "ТЗ", NORM: "Търговски закон" },
  { ORTH: "ТКЗС", NORM: "Трудово кооперативно земеделско стопанство" },
  { ORTH: "ТКЗС-то", NORM: "Трудово кооперативно земеделско стопанство" },
  { ORTH: "ТОА", NORM: "Териториална общинска администрация" },
  { ORTH: "ТР", NORM: "Търговски регистър" },
  { ORTH: "ТУ", NORM: "Технически университет" },
  {
    ORTH: "ТУДА",
    NORM: "Териториално управление на данъчната администрация"
  },
  { ORTH: "УАГ", NORM: "Управление Архитектура и градоустройство" },
  {
    ORTH: "УАСГ",
    NORM: "Университет по архитектура, строителство и геодезия"
  },
  { ORTH: "УБО", NORM: "Управление за безопасност и охрана" },
  { ORTH: "УЕФА", NORM: "Съюз на европейските футболни асоциации" },
  { ORTH: "УКВ", NORM: "Ултракъси вълни" },
  {
    ORTH: "УНИЦЕФ",
    NORM: "Извънреден фонд за детски помощи при Организацията на обединените нации"
  },
  { ORTH: "УНСС", NORM: "Университет за национално и световно стопанство" },
  { ORTH: "УС", NORM: "Управителен съвет" },
  {
    ORTH: "ФАР",
    NORM: "Програма на ЕС за подпомагане на реформите в Полша, Унгария"
  },
  { ORTH: "ФБК", NORM: "Финансово-брокерска къща" },
  { ORTH: "ФБК-та", NORM: "Финансово-брокерска къща" },
  { ORTH: "ФИБА", NORM: "Международна федерация по баскетбол за аматьори" },
  {
    ORTH: "ФИВБ",
    NORM: "Международна ветеринарно-зоотехническа федерация"
  },
  { ORTH: "ФБР", NORM: "Федерално бюро за разследване" },
  { ORTH: "ФИФА", NORM: "Международна федерация на футболните асоциации" },
  { ORTH: "ФК", NORM: "Финансов контрол" },
  { ORTH: "ФК", NORM: "Финансова къща" },
  { ORTH: "ФК", NORM: "Футболен клуб" },
  { ORTH: "ФОО", NORM: "Фонд Обществено осигуряване" },
  { ORTH: "ФСБ", NORM: "Формация Студио Балкантон" },
  { ORTH: "ХДС", NORM: "Християн-демократически съюз" },
  { ORTH: "ХЕИ", NORM: "Хигиенно-епидемиологичен институт" },
  { ORTH: "ХСС", NORM: "Християн-социален съюз" },
  { ORTH: "ЦБ", NORM: "Централно бюро" },
  { ORTH: "ЦД", NORM: "Централен депозитар" },
  { ORTH: "ЦДГ", NORM: "Целодневна детска градина" },
  { ORTH: "ЦЕФТА", NORM: "Централно-европейски съюз за свободна търговия" },
  { ORTH: "ЦИК", NORM: "Централна избирателна комисия" },
  { ORTH: "ЦК", NORM: "Централен комитет" },
  { ORTH: "ЦКБ", NORM: "Централна кооперативна банка" },
  { ORTH: "ЦКС", NORM: "Централен кооперативен съюз" },
  { ORTH: "ЦРУ", NORM: "Централно разузнавателно управление" },
  {
    ORTH: "ЦСБОП",
    NORM: "Централен съвет за борба с организираната престъпност"
  },
  { ORTH: "ЦС", NORM: "Централен съвет" },
  { ORTH: "ЦСКА", NORM: "Централен спортен клуб на армията" },
  { ORTH: "ЦСУ", NORM: "Централно статистическо управление" },
  { ORTH: "ЦУМ", NORM: "Централен универсален магазин" },
  { ORTH: "ЧЗИБ", NORM: "Частна земеделска инвестиционна банка" },
  { ORTH: "ШЗО", NORM: "Школа за запасни офицери" },
  { ORTH: "ЮАР", NORM: "Южноафриканска република" },
  { ORTH: "ЮИЕ", NORM: "Югоизточна Европа" },
  {
    ORTH: "ЮНЕСКО",
    NORM: "Организация на Обединените нации за образование, наука и изкуство"
  },
   { ORTH: "ИСМП", NORM: "Институт за спешна медицинска помощ" }
]

for abbr in  ABBR_UPPERCASE_EXC:
    _exc[abbr[ORTH]] = [abbr]

TOKENIZER_EXCEPTIONS = _exc